zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSpu_reg.h
/** \brief 168, Bin Rejection Mask */
#define SPU0_BIN_REJ34 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800168u)
/** Alias (User Manual Name) for SPU0_BIN_REJ34.
* To use register names with standard convension, please use SPU0_BIN_REJ34.
*/
#define SPU0_BIN34_REJ (SPU0_BIN_REJ34)

/** \brief 16C, Bin Rejection Mask */
#define SPU0_BIN_REJ35 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80016Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ35.
* To use register names with standard convension, please use SPU0_BIN_REJ35.
*/
#define SPU0_BIN35_REJ (SPU0_BIN_REJ35)

/** \brief 170, Bin Rejection Mask */
#define SPU0_BIN_REJ36 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800170u)
/** Alias (User Manual Name) for SPU0_BIN_REJ36.
* To use register names with standard convension, please use SPU0_BIN_REJ36.
*/
#define SPU0_BIN36_REJ (SPU0_BIN_REJ36)

/** \brief 174, Bin Rejection Mask */
#define SPU0_BIN_REJ37 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800174u)
/** Alias (User Manual Name) for SPU0_BIN_REJ37.
* To use register names with standard convension, please use SPU0_BIN_REJ37.
*/
#define SPU0_BIN37_REJ (SPU0_BIN_REJ37)

/** \brief 178, Bin Rejection Mask */
#define SPU0_BIN_REJ38 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800178u)
/** Alias (User Manual Name) for SPU0_BIN_REJ38.
* To use register names with standard convension, please use SPU0_BIN_REJ38.
*/
#define SPU0_BIN38_REJ (SPU0_BIN_REJ38)

/** \brief 17C, Bin Rejection Mask */
#define SPU0_BIN_REJ39 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80017Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ39.
* To use register names with standard convension, please use SPU0_BIN_REJ39.
*/
#define SPU0_BIN39_REJ (SPU0_BIN_REJ39)

/** \brief 180, Bin Rejection Mask */
#define SPU0_BIN_REJ40 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800180u)
/** Alias (User Manual Name) for SPU0_BIN_REJ40.
* To use register names with standard convension, please use SPU0_BIN_REJ40.
*/
#define SPU0_BIN40_REJ (SPU0_BIN_REJ40)

/** \brief 184, Bin Rejection Mask */
#define SPU0_BIN_REJ41 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800184u)
/** Alias (User Manual Name) for SPU0_BIN_REJ41.
* To use register names with standard convension, please use SPU0_BIN_REJ41.
*/
#define SPU0_BIN41_REJ (SPU0_BIN_REJ41)

/** \brief 188, Bin Rejection Mask */
#define SPU0_BIN_REJ42 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800188u)
/** Alias (User Manual Name) for SPU0_BIN_REJ42.
* To use register names with standard convension, please use SPU0_BIN_REJ42.
*/
#define SPU0_BIN42_REJ (SPU0_BIN_REJ42)

/** \brief 18C, Bin Rejection Mask */
#define SPU0_BIN_REJ43 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80018Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ43.
* To use register names with standard convension, please use SPU0_BIN_REJ43.
*/
#define SPU0_BIN43_REJ (SPU0_BIN_REJ43)

/** \brief 190, Bin Rejection Mask */
#define SPU0_BIN_REJ44 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800190u)
/** Alias (User Manual Name) for SPU0_BIN_REJ44.
* To use register names with standard convension, please use SPU0_BIN_REJ44.
*/
#define SPU0_BIN44_REJ (SPU0_BIN_REJ44)

/** \brief 194, Bin Rejection Mask */
#define SPU0_BIN_REJ45 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800194u)
/** Alias (User Manual Name) for SPU0_BIN_REJ45.
* To use register names with standard convension, please use SPU0_BIN_REJ45.
*/
#define SPU0_BIN45_REJ (SPU0_BIN_REJ45)

/** \brief 198, Bin Rejection Mask */
#define SPU0_BIN_REJ46 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA800198u)
/** Alias (User Manual Name) for SPU0_BIN_REJ46.
* To use register names with standard convension, please use SPU0_BIN_REJ46.
*/
#define SPU0_BIN46_REJ (SPU0_BIN_REJ46)

/** \brief 19C, Bin Rejection Mask */
#define SPU0_BIN_REJ47 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA80019Cu)
/** Alias (User Manual Name) for SPU0_BIN_REJ47.
* To use register names with standard convension, please use SPU0_BIN_REJ47.
*/
#define SPU0_BIN47_REJ (SPU0_BIN_REJ47)

/** \brief 1A0, Bin Rejection Mask */
#define SPU0_BIN_REJ48 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001A0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ48.
* To use register names with standard convension, please use SPU0_BIN_REJ48.
*/
#define SPU0_BIN48_REJ (SPU0_BIN_REJ48)

/** \brief 1A4, Bin Rejection Mask */
#define SPU0_BIN_REJ49 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001A4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ49.
* To use register names with standard convension, please use SPU0_BIN_REJ49.
*/
#define SPU0_BIN49_REJ (SPU0_BIN_REJ49)

/** \brief 1A8, Bin Rejection Mask */
#define SPU0_BIN_REJ50 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001A8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ50.
* To use register names with standard convension, please use SPU0_BIN_REJ50.
*/
#define SPU0_BIN50_REJ (SPU0_BIN_REJ50)

/** \brief 1AC, Bin Rejection Mask */
#define SPU0_BIN_REJ51 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001ACu)
/** Alias (User Manual Name) for SPU0_BIN_REJ51.
* To use register names with standard convension, please use SPU0_BIN_REJ51.
*/
#define SPU0_BIN51_REJ (SPU0_BIN_REJ51)

/** \brief 1B0, Bin Rejection Mask */
#define SPU0_BIN_REJ52 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001B0u)
/** Alias (User Manual Name) for SPU0_BIN_REJ52.
* To use register names with standard convension, please use SPU0_BIN_REJ52.
*/
#define SPU0_BIN52_REJ (SPU0_BIN_REJ52)

/** \brief 1B4, Bin Rejection Mask */
#define SPU0_BIN_REJ53 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001B4u)
/** Alias (User Manual Name) for SPU0_BIN_REJ53.
* To use register names with standard convension, please use SPU0_BIN_REJ53.
*/
#define SPU0_BIN53_REJ (SPU0_BIN_REJ53)

/** \brief 1B8, Bin Rejection Mask */
#define SPU0_BIN_REJ54 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_BIN_REJ*)0xFA8001B8u)
/** Alias (User Manual Name) for SPU0_BIN_REJ54.
* To use register names with standard convension, please use SPU0_BIN_REJ54.
*/
#define SPU0_BIN54_REJ (SPU0_BIN_REJ54)

