zephyrproject-rtos/hal_infineon/aurix-illd/tc3x/Sfr/TC39xB/IfxSpu_reg.h
/** \brief 2BC, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT3 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002BCu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT3.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT3.
*/
#define SPU1_MD1_MASK3_ACCEPT (SPU1_MD1_MASK_ACCEPT3)

/** \brief 2C0, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT4 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002C0u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT4.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT4.
*/
#define SPU1_MD1_MASK4_ACCEPT (SPU1_MD1_MASK_ACCEPT4)

/** \brief 2C4, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT5 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002C4u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT5.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT5.
*/
#define SPU1_MD1_MASK5_ACCEPT (SPU1_MD1_MASK_ACCEPT5)

/** \brief 2C8, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT6 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002C8u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT6.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT6.
*/
#define SPU1_MD1_MASK6_ACCEPT (SPU1_MD1_MASK_ACCEPT6)

/** \brief 2CC, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT7 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002CCu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT7.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT7.
*/
#define SPU1_MD1_MASK7_ACCEPT (SPU1_MD1_MASK_ACCEPT7)

/** \brief 2D0, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT8 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002D0u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT8.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT8.
*/
#define SPU1_MD1_MASK8_ACCEPT (SPU1_MD1_MASK_ACCEPT8)

/** \brief 2D4, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT9 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002D4u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT9.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT9.
*/
#define SPU1_MD1_MASK9_ACCEPT (SPU1_MD1_MASK_ACCEPT9)

/** \brief 2D8, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT10 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002D8u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT10.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT10.
*/
#define SPU1_MD1_MASK10_ACCEPT (SPU1_MD1_MASK_ACCEPT10)

/** \brief 2DC, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT11 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002DCu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT11.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT11.
*/
#define SPU1_MD1_MASK11_ACCEPT (SPU1_MD1_MASK_ACCEPT11)

/** \brief 2E0, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT12 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002E0u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT12.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT12.
*/
#define SPU1_MD1_MASK12_ACCEPT (SPU1_MD1_MASK_ACCEPT12)

/** \brief 2E4, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT13 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002E4u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT13.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT13.
*/
#define SPU1_MD1_MASK13_ACCEPT (SPU1_MD1_MASK_ACCEPT13)

/** \brief 2E8, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT14 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002E8u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT14.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT14.
*/
#define SPU1_MD1_MASK14_ACCEPT (SPU1_MD1_MASK_ACCEPT14)

/** \brief 2EC, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT15 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002ECu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT15.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT15.
*/
#define SPU1_MD1_MASK15_ACCEPT (SPU1_MD1_MASK_ACCEPT15)

/** \brief 2F0, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT16 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002F0u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT16.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT16.
*/
#define SPU1_MD1_MASK16_ACCEPT (SPU1_MD1_MASK_ACCEPT16)

/** \brief 2F4, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT17 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002F4u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT17.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT17.
*/
#define SPU1_MD1_MASK17_ACCEPT (SPU1_MD1_MASK_ACCEPT17)

/** \brief 2F8, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT18 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002F8u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT18.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT18.
*/
#define SPU1_MD1_MASK18_ACCEPT (SPU1_MD1_MASK_ACCEPT18)

/** \brief 2FC, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT19 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC002FCu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT19.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT19.
*/
#define SPU1_MD1_MASK19_ACCEPT (SPU1_MD1_MASK_ACCEPT19)

/** \brief 300, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT20 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00300u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT20.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT20.
*/
#define SPU1_MD1_MASK20_ACCEPT (SPU1_MD1_MASK_ACCEPT20)

/** \brief 304, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT21 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00304u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT21.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT21.
*/
#define SPU1_MD1_MASK21_ACCEPT (SPU1_MD1_MASK_ACCEPT21)

/** \brief 308, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT22 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00308u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT22.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT22.
*/
#define SPU1_MD1_MASK22_ACCEPT (SPU1_MD1_MASK_ACCEPT22)

/** \brief 30C, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT23 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC0030Cu)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT23.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT23.
*/
#define SPU1_MD1_MASK23_ACCEPT (SPU1_MD1_MASK_ACCEPT23)

/** \brief 310, Bin Acceptance  Mask */
#define SPU1_MD1_MASK_ACCEPT24 /*lint --e(923, 9078)*/ (*(volatile Ifx_SPU_MD_MASK_ACCEPT*)0xFAC00310u)
/** Alias (User Manual Name) for SPU1_MD1_MASK_ACCEPT24.
* To use register names with standard convension, please use SPU1_MD1_MASK_ACCEPT24.
*/
#define SPU1_MD1_MASK24_ACCEPT (SPU1_MD1_MASK_ACCEPT24)

